app/Validation/AuthRules.php

SELECT *
FROM `user`
WHERE `email` = 'dkaaa@gmail.com'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
  public function validateUser(string $str, string $fields, array $data)
  {
    $model = new UserModel();
    $user = $model->where('email', $data['email'])
      ->first();