app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `email` = 'dkaaa@gmail.com'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function index()
    {
        $data = [];
        helper(['form']);

        // echo "<h1>AuthController :: index()</h1>";

        if(session()->get('isLoggedIn')){
            return redirect()->to('/dashboard');
        }

        if($this->request->getMethod() == 'post'){  // check if method is POST, because GET could cause some problems
            //validations
            $rules = [
                'email' => 'required',
                'password' => 'required|validateUser[email,password]',
            ];

            $errors = $this->customConfig->user_validation_errors();
            $errors['password']['validateUser'] = 'Błędny '.$this->customConfig->email_name.' lub '.$this->customConfig->password_name.'.';

            if(! $this->validate($rules, $errors)){
                // handle validation erros
                $data ['validation'] = $this->validator;

            } else {
                // try to login
                // inicialize model
                $model = new UserModel();

                $user = $model->where('email',$this->request->getVar('email'))
                                -> first();