app/Controllers/Buildings.php

SELECT *
FROM `building`
WHERE `building`.`deleted_at` IS NULL
AND `building`.`id` = '11'
---
    public function info($id){

        $data = [];
        $building_model = new BuildingModel();
        $room_model = new RoomModel();
        $reservation_model = new ReservationModel();

        $data['current_building_info'] = $building_model->find($id);