app/Controllers/Dashboard.php

SELECT *
FROM `slot`
WHERE `slot`.`deleted_at` IS NULL
SELECT *
FROM `building`
WHERE `building`.`deleted_at` IS NULL
SELECT *
FROM `room`
WHERE `room`.`deleted_at` IS NULL
---
    public function index()
    {
        $data = [];
        $today = date('Y-m-d');

        echo view('templates/header');

        if (session()->get('isModerator')) {
            $reservation_model = new ReservationModel();
            $slot_model = new SlotModel();

            $data['slots_count_total'] = count($slot_model->findAll());

            $reservations_data = $reservation_model->findAllJoinFullDataOrdered();
            $reservations_data = $reservation_model->addColumnReservationStatus($reservations_data);

            $data['today_residents_count'] = count($reservation_model->filterFullReservationsDataByFieldValue($reservations_data, 'reservation_status', 1));

            $data['buildings_count'] = count((new BuildingModel())->findAll());
            $data['rooms_count_total'] = count((new RoomModel())->findAll());