app/Controllers/Rooms.php

SELECT *
FROM `building`
WHERE `building`.`deleted_at` IS NULL
AND `building`.`id` = '11'
---
    public function by_building($id)
    {

        $data = [];

        $model = new BuildingModel();
        $data['building'] = $model->find($id);

SELECT *
FROM `room`
WHERE `room`.`deleted_at` IS NULL
AND `room`.`id` = '95'
SELECT *
FROM `room_type`
WHERE `room_type`.`deleted_at` IS NULL
AND `room_type`.`id` = '2'
SELECT *
FROM `building`
WHERE `building`.`deleted_at` IS NULL
AND `building`.`id` = '11'
---
    public function info($id){
        $room_model = new RoomModel();
        $room_data = $room_model->find($id);


        if(!$room_data){
            session()->setFlashdata('failure', 'Pokój o ID #'.$id.' nie istnieje lub został usunięty!');
            return redirect()->to('/buildings');
        } else{
            $rooms_type_model = new RoomTypeModel();
            $building_model = new BuildingModel();
            $reservation_model = new ReservationModel();
            $slot_model = new SlotModel();

            $data = [
                'room_data' => $room_data,
                'room_type_data' => $rooms_type_model->find($room_data['room_type_id']),
                'building_data' => $building_model->find($room_data['building_id']),