app/Models/ReservationModel.php

SELECT `reservation`.`id` as `reservation_id`, `reservation`.`notes` as `reservation_notes`, `reservation`.`start_time` as `reservation_start_time`, `reservation`.`end_time` as `reservation_end_time`, `reservation`.`type` as `type`, `reservation`.`price` as `reservation_price`, `reservation`.`payment_done` as `reservation_payment_done`, `reservation`.`contract_number` as `reservation_contract_number`, `reservation`.`created_at` as `reservation_created_at`, `reservation`.`updated_at` as `reservation_updated_at`, `reservation`.`deleted_at` as `reservation_deleted_at`, `user`.`id` as `user_id`, `user`.`email` as `user_email`, `user`.`firstname` as `user_firstname`, `user`.`lastname` as `user_lastname`, `slot`.`id` as `slot_id`, `slot`.`name` as `slot_name`, `room`.`id` as `room_id`, `room`.`number` as `room_number`, `building`.`id` as `building_id`, `building`.`name` as `building_name`
FROM `reservation`
JOIN `user` ON `user`.`id` = `reservation`.`user_id`
JOIN `slot` ON `slot`.`id` = `reservation`.`slot_id`
JOIN `room` ON `room`.`id` = `reservation`.`slot_room_id`
JOIN `building` ON `building`.`id` = `reservation`.`slot_room_building_id`
WHERE `reservation`.`deleted_at` IS NULL
ORDER BY `end_time` ASC
---
    public function findAllJoinFullDataOrdered($order = "end_time ASC")
    {
        return $this->db->table('reservation')
            ->select('
                    reservation.id as reservation_id,
                    reservation.notes as reservation_notes,
                    reservation.start_time as reservation_start_time,
                    reservation.end_time as reservation_end_time,
                    reservation.type as type,
                    reservation.price as reservation_price,
                    reservation.payment_done as reservation_payment_done,
                    reservation.contract_number as reservation_contract_number,
                    reservation.created_at as reservation_created_at,
                    reservation.updated_at as reservation_updated_at,
                    reservation.deleted_at as reservation_deleted_at,
                    user.id as user_id,
                    user.email as user_email,
                    user.firstname as user_firstname,
                    user.lastname as user_lastname,
                    slot.id as slot_id,
                    slot.name as slot_name,
                    room.id as room_id,
                    room.number as room_number,
                    building.id as building_id,
                    building.name as building_name,
                    ')
            ->where('reservation.deleted_at IS NULL') // IMPORTANT!
            ->join('user', 'user.id = reservation.user_id')
            ->join('slot', 'slot.id = reservation.slot_id')
            ->join('room', 'room.id = reservation.slot_room_id')
            ->join('building', 'building.id = reservation.slot_room_building_id')
            ->orderBy($order)
            ->get()
            ->getResultArray();

SELECT `reservation`.`id` as `reservation_id`, `reservation`.`notes` as `reservation_notes`, `reservation`.`start_time` as `reservation_start_time`, `reservation`.`end_time` as `reservation_end_time`, `reservation`.`type` as `type`, `reservation`.`price` as `reservation_price`, `reservation`.`payment_done` as `reservation_payment_done`, `reservation`.`contract_number` as `reservation_contract_number`, `reservation`.`created_at` as `reservation_created_at`, `reservation`.`updated_at` as `reservation_updated_at`, `reservation`.`deleted_at` as `reservation_deleted_at`, `user`.`id` as `user_id`, `user`.`email` as `user_email`, `user`.`firstname` as `user_firstname`, `user`.`lastname` as `user_lastname`, `slot`.`id` as `slot_id`, `slot`.`name` as `slot_name`, `room`.`id` as `room_id`, `room`.`number` as `room_number`, `building`.`id` as `building_id`, `building`.`name` as `building_name`
FROM `reservation`
JOIN `user` ON `user`.`id` = `reservation`.`user_id`
JOIN `slot` ON `slot`.`id` = `reservation`.`slot_id`
JOIN `room` ON `room`.`id` = `reservation`.`slot_room_id`
JOIN `building` ON `building`.`id` = `reservation`.`slot_room_building_id`
WHERE `reservation`.`slot_id` = 191
AND `reservation`.`deleted_at` IS NULL
ORDER BY `end_time` ASC
---
    public function findAllWhereSlotJoinFullDataOrdered($slot_id, $order = "end_time ASC")
    {
        return $this->db->table('reservation')
            ->select('
                        reservation.id as reservation_id,
                        reservation.notes as reservation_notes,
                        reservation.start_time as reservation_start_time,
                        reservation.end_time as reservation_end_time,
                        reservation.type as type,
                        reservation.price as reservation_price,
                        reservation.payment_done as reservation_payment_done,
                        reservation.contract_number as reservation_contract_number,
                        reservation.created_at as reservation_created_at,
                        reservation.updated_at as reservation_updated_at,
                        reservation.deleted_at as reservation_deleted_at,
                        user.id as user_id,
                        user.email as user_email,
                        user.firstname as user_firstname,
                        user.lastname as user_lastname,
                        slot.id as slot_id,
                        slot.name as slot_name,
                        room.id as room_id,
                        room.number as room_number,
                        building.id as building_id,
                        building.name as building_name,
                    ')
            ->where('reservation.slot_id = ' . $slot_id)
            ->where('reservation.deleted_at IS NULL') // IMPORTANT!
            ->join('user', 'user.id = reservation.user_id')
            ->join('slot', 'slot.id = reservation.slot_id')
            ->join('room', 'room.id = reservation.slot_room_id')
            ->join('building', 'building.id = reservation.slot_room_building_id')
            ->orderBy($order)
            ->get()
            ->getResultArray();