app/Models/RoomModel.php

    function findWhereBuildingIdJoinRoomTypeOrdered($building_id, $order='room.floor_eu ASC, room.number ASC') {
        return $this->db->table('room')
            ->select('room.id as room_id, room.building_id, room.number, room.floor_eu, room.room_type_id, room.created_at as room_created_at, room.updated_at as room_updated_at, room_type.id as room_type_id, room_type.name as room_type_name')
            ->where('room.building_id', $building_id)
            ->where ('room.deleted_at IS NULL') // IMPORTANT!
            ->join('room_type', 'room_type.id = room.room_type_id', 'inner')
            ->orderBy($order)
            ->get()
            ->getResultArray();
---
SELECT `room`.`id` as `room_id`, `room`.`building_id`, `room`.`number`, `room`.`floor_eu`, `room`.`room_type_id`, `room`.`created_at` as `room_created_at`, `room`.`updated_at` as `room_updated_at`, `room_type`.`id` as `room_type_id`, `room_type`.`name` as `room_type_name`
FROM `room`
INNER JOIN `room_type` ON `room_type`.`id` = `room`.`room_type_id`
WHERE `room`.`building_id` = '11'
AND `room`.`deleted_at` IS NULL
ORDER BY `room`.`floor_eu` ASC, `room`.`number` ASC

    function findAllWhereBuildingJoinSlots($building_id, $select) {
        return $this->db->table('room')
            ->select($select)
            ->where('room.building_id', $building_id)
            ->where ('room.deleted_at IS NULL') // IMPORTANT!
            ->join('slot', 'room.id = slot.room_id', 'inner')
            ->get()
            ->getResultArray();
---
SELECT `slot`.`id` as `id`, `room`.`id` as `room_id`
FROM `room`
INNER JOIN `slot` ON `room`.`id` = `slot`.`room_id`
WHERE `room`.`building_id` = '11'
AND `room`.`deleted_at` IS NULL

    public function countRoomsInBuilding($buildingId) {
        $data = $this->db->table('room')
            ->selectCount('id')
            ->where ('room.deleted_at IS NULL')
            ->where('building_id', $buildingId)
            ->groupBy('building_id')
            ->get()
            ->getRowArray();
---
SELECT COUNT(`id`) AS `id`
FROM `room`
WHERE `room`.`deleted_at` IS NULL
AND `building_id` = '11'
GROUP BY `building_id`