app/Libraries/PrivilegesManager.php

    public function isUserModerator($id): bool
    {
        $userData = $this->user_model->find(($id));
---
SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`id` = '114'